public class Ex1 {
    public static void main(String[] args) {
        for (int i =1;i<=5;i++){
            System.out.println(i + "");
        }
    }
}
//Необходимо вывести на экран числа от 1 до 5. На экране должно быть:
//
//1 2 3 4 5


//int i = 1;   - это начальное значение переменной
 //       i<=5;  - это условие,  при котором будет выполняться цикл
 //       i++ - это шаг, с которым будет выполняться цикл. В данном случае мы использовали инкремент, а значит переменная будет увеличиваться на 1. То есть с 1 до 2, с 2 до 3, с 3 до 4, с 4 до 5.
